karrister/pic16f_wiznet/MPLAB/pic16_eth_test.X/main.c
/*reg addr end*/

typedef unsigned char BYTE;

typedef BYTE KARRI_BOOL;

typedef enum {
            IDLE,
            LISTENING,
            PEER_CONNECTED,
            REQUEST_RECEIVED,
            PARSE_REQUEST,
            SEND_RESPONSE
} mainserverSM;

typedef enum {
            PARSE_NO_MATCH,
            PARSE_MATCH,
            PARSE_LED1,
            PARSE_LED2,
            PARSE_LED3,
            PARSE_LED4,
} PARSE_STATUS;

/*Static */

/*static const saves it in the program memory, not RAM*/

static const BYTE get_cmd[] = "GET /";

#if 0
static const BYTE website_template[] =

"HTTP/1.1 404 Not Found \
Date: Sat, 10 May 2014 08:54:23 GMT \
Server: Apache/2.2.22 (Ubuntu) \
Vary: Accept-Encoding \
Content-Length: 291 \
Content-Type: text/html; charset=iso-8859-1 \
<!DOCTYPE HTML PUBLIC \"-//IETF//DTD HTML 2.0//EN\"> \
<html><head> \
<title>404 Not Found</title> \
</head><body> \
<h1>Not Found</h1> \
<p>The requested URL /index.htm was not found on this server.</p> \
<hr> \
<address>Apache/2.2.22 (Ubuntu) Server at www.karrikivela.fi Port 80</address> \
</body></html> \
";
#endif

/*Globals*/
short g_portc = 0;


int g_rx_sock0_mask;
int g_rx_sock0_base;

int g_rx_sock1_mask;
int g_rx_sock1_base;

int g_tx_sock0_mask;
int g_tx_sock0_base;

int g_tx_sock1_mask;
int g_tx_sock1_base;

int g_mainSM_state = IDLE;

/*Macros for turning LEDs on*/
#define LED1_ON() \
  do { \
    g_portc |= 0x01; \
    PORTC = g_portc;\
  } while (0)

#define LED2_ON() \
  do { \
    g_portc |= 0x02; \
    PORTC = g_portc;\
  } while (0)

#define LED3_ON() \
  do { \
    g_portc |= 0x04; \
    PORTC = g_portc;\
  } while (0)

#define LED4_ON() \
  do { \
    g_portc |= 0x08; \
    PORTC = g_portc;\
  } while (0)

/*Macros for turning LEDs off*/
#define LED1_OFF() \
  do { \
    g_portc &= 0xFE; \
    PORTC = g_portc;\
  } while (0)

#define LED2_OFF() \
  do { \
    g_portc &= 0xFD; \
    PORTC = g_portc;\
  } while (0)

#define LED3_OFF() \
  do { \
    g_portc &= 0xFB; \
    PORTC = g_portc;\
  } while (0)

#define LED4_OFF() \
  do { \
    g_portc &= 0xF7; \
    PORTC = g_portc;\
  } while (0)

#define RESET_LOW() \
  do { \
    PORTCbits.RC4 = 0; \
  } while (0)

#define RESET_HIGH() \
  do { \
    g_portc = PORTC;\
    g_portc |= BIT4;\
    PORTC = g_portc;\
  } while (0)


/*SPI macros*/
#define CS_ASSERT() \
  do { \
    PORTCbits.RC6 = 0; \
  } while (0)

#define CS_DEASSERT() \
  do { \
    PORTCbits.RC6 = 1; \
  } while (0)


#define DELAY_BETWEEN_COMMANDS() delay(5000)

#define SPI_SYNC_TX_BYTE(tx_byte) \
    do { \
        PIR1bits.SSPIF = 0; \
        SSPBUF = tx_byte; \
        while(!PIR1bits.SSPIF); \
        PIR1bits.SSPIF = 0; \
    } while(0)


#define WIZNET_WRITE(addr, byte) \
    do { \
        CS_ASSERT();\
        SPI_SYNC_TX_BYTE(0xF0);\
        SPI_SYNC_TX_BYTE((addr & 0xFF00) >> 8);\
        SPI_SYNC_TX_BYTE(addr & 0x00FF);\
        SPI_SYNC_TX_BYTE(byte);\
        CS_DEASSERT();\
    } while(0)


#ifdef UART_DEBUG
/**
* This inline function outputs debug messages out of the chip UART bus.
* @param msg The debug message.
* @return void
*/
inline void debug_print(DEBUG_MSG *msg)
{
    int x;
    for(x=0;x<MAX_UART_PRINT_LENGTH;x++)
    {
        if(msg[x] == '\n') //break character
        {
            break;
        }

        while(!TXSTAbits.TRMT);

        TXREG = msg[x];
    }

    while(!TXSTAbits.TRMT);
    TXREG = 0x0A;
    while(!TXSTAbits.TRMT);
    TXREG = 0x0D;

}
#else
inline void debug_print(DEBUG_MSG *msg)
{
    _nop();
}
#endif //UART_DEBUG

/**
* This inline function reads a single byte from the chip. This function manages
* the data transfer over the SPI bus from the chip towards the master.
* @param addr The address inside the chip to read from.
* @return The byte read from the chip.
*/
inline unsigned char
wiznet_read(unsigned int addr)
{
    unsigned char rxByte = 0;
    CS_ASSERT();
    SPI_SYNC_TX_BYTE(READ_OPCODE);
    SPI_SYNC_TX_BYTE((addr & 0xFF00) >> 8);
    SPI_SYNC_TX_BYTE(addr & 0x00FF);
    SPI_SYNC_TX_BYTE(0x00); //dummy data, just for clock output
    rxByte = SSPBUF;
    CS_DEASSERT();
    return rxByte;
}


/**
* This function compares the input buffer to a command buffer and tries to find
* the specified command inside the input buffer (the offset doesn't matter).
* @param eth_buff pointer to the input buffer.
* @param cmd pointer to the command buffer.
* @param input_size the size of the data in the eth_buff input buffer
* @param cmd_size the size of the command we are looking for
* @param buffer_offset pointer to uint where the function will save the offset in the input buffer where the match was found
* @see main()
* @return The boolean result if the specified command was found inside the input buffer.
*/
inline KARRI_BOOL compare_buffers(BYTE *eth_buff, BYTE *cmd, unsigned int input_size, unsigned int cmd_size, unsigned int *buffer_offset)
{
    int get_cmd_lookup_loop, get_cmd_matching_loop;
    for(get_cmd_lookup_loop = 0; get_cmd_lookup_loop < input_size; get_cmd_lookup_loop++)
    {
        *buffer_offset = get_cmd_lookup_loop;
        if(eth_buff[get_cmd_lookup_loop] == cmd[0])
        {
            for(get_cmd_matching_loop = 0; get_cmd_matching_loop < cmd_size; get_cmd_matching_loop++)
            {
                if(eth_buff[get_cmd_lookup_loop + get_cmd_matching_loop] != cmd[get_cmd_matching_loop])
                {
#if 1
                    BYTE debug_string[] = "0123";
                    sprintf( debug_string, "offset fail: %d\n", get_cmd_matching_loop );
                    debug_print(debug_string);
#endif
                    /* No CMD found afterall */
                    return KARRI_NOK;
                }
            }
            /* If we get here, it means we got successfully out of the for-loop and found our CMD */
            return KARRI_OK;
        }
    }

    /* If we get here, it means we couldn't find our CMD */
    return KARRI_NOK;
}


/**
* This function compares the input buffer to a command buffer and tries to find
* the specified command inside the input buffer (the offset doesn't matter).
* If there was a match, next task is to find out, starting from the offset of
* after the basic command, looking through the incoming ethernet buffer and trying
* to find some specific commands, and returning the result as a PARSE_STATUS enum.
* @param eth_buff pointer to the input buffer.
* @param cmd pointer to the command buffer.
* @param input_size the size of the data in the eth_buff input buffer
* @param cmd_size the size of the command we are looking for
* @see compare_buffers()
* @see main()
* @return The result of the parsing.
*/
inline PARSE_STATUS parse_command(BYTE *eth_buff, BYTE *cmd, unsigned int input_size, unsigned int cmd_size)
{
    PARSE_STATUS ret = PARSE_NO_MATCH;
    BYTE        *command_buffer;
    unsigned int buffer_offset;
    if(!compare_buffers(eth_buff, cmd, input_size, cmd_size, &buffer_offset))
    {
        /* No match was found, return immediately */
        return PARSE_NO_MATCH;
    }

    /* Let's make the buffer to point to local pointer from the wanted offset, after the initial command */
    command_buffer = eth_buff + buffer_offset + cmd_size;

    /* Get ready... Here is the huge parser! */
    if(command_buffer[0] == 'l' &&
       command_buffer[1] == 'e' &&
       command_buffer[2] == 'd')
    {
        if(command_buffer[3] == '1')
        {
            ret = PARSE_LED1;
        }
        if(command_buffer[3] == '2')
        {
            ret = PARSE_LED2;
        }
        if(command_buffer[3] == '3')
        {
            ret = PARSE_LED3;
        }
        if(command_buffer[3] == '4')
        {
            ret = PARSE_LED4;
        }
    }
    
    return ret;
}

