karrister/pic16f_wiznet/MPLAB/pic16_eth_test.X/main.c
    /*SPI init*/

    //Set RC6 (SS) to output
    TRISCbits.TRISC6 = 0;

    //Set RC7 (SDO) to output
    TRISCbits.TRISC7 = 0;
    //Set RB6 (SCL) to output
    TRISBbits.TRISB6 = 0;
    //Set RB4 (SDI) to input
    TRISBbits.TRISB4 = 1;

    //Disable the pull up resistors for all the PORTB pins 4-7
    WPUB = 0;
    //Disable the itnerrupt on change for all the PORTB pins 4-7
    IOCB = 0;
    
    //SPI idle low (CKP = 0), Data transmitted on rising edge (CKE = 1)
    SSPSTAT = /*0xC0;*/ 0x40;
    SSPCON = 0x21; //SCL fOSC/16 == 250kHz

#ifdef UART_DEBUG
    /*Debug UART init*/
    TXSTA = 0x24; //enable TX, high baud bit
    RCSTA = 0x80; //enable serial
    BAUDCTL = 0; //8-bit baud rate generator

    SPBRG = 0x19; //9600baud
#endif

    /*Wiznet CHIP HW reset*/
    RESET_LOW();
    RESET_HIGH();

    /*This is for some reason important!*/
    CS_ASSERT();
    CS_DEASSERT();
}


int main(void)
{
    short spi_status = KARRI_NOK;
    dev_init();
LED1_ON();
    //Sleep after init (needed?)
    delay(60000);
LED1_OFF();
    delay(60000);
    delay(60000);
    delay(60000);
    delay(60000);


#ifdef KARRI_DEBUG
    //Indicate init finished, firmware started
    LED1_ON();
    debug_print("Init finished, LED1 on, FW started!\n");

#endif //KARRI_DEBUG

#ifdef SPI_DEBUG //When suspect problems with SPI bus
    //debug_print("Testing connection to CHIP!\n");

    delay(60000);
    delay(60000);
    delay(60000);
    delay(60000);
    delay(60000);

    spi_status = test_wiznet_connection();
#ifndef KARRI_DEBUG
    if(spi_status != KARRI_OK)
    {
        //Indicate connection to wiznet was NOK
        //debug_print("Connection to CHIP failed!\n");
        LED3_ON();
        while(1);
    }
#endif //KARRI_DEBUG
    //Indicate connection to wiznet was OK
    debug_print("Connection to CHIP OK\n");
    LED1_ON();

#else //SPI_DEBUG
    _nop();
#endif //SPI_DEBUG
#if 1 //karri comment out rest of the app
    //Init ETH
    init_wiznet();

    LED1_OFF();
#ifdef KARRI_DEBUG
    debug_print("Went through CHIP init, entering main state machine!\n");
#endif

    BYTE spi_rx_byte                          = 0;

    unsigned int rx_data_size                 = 0;
#ifdef EXTENDED_FUNCTIONALITY
    unsigned int rx_data_offset               = 0;
    unsigned int rx_data_start_addr           = 0;
    unsigned int rx_sock1_read_pointer        = 0;
    unsigned int rx_upper_size                = 0;
#endif
    unsigned int tx_data_size                 = 0;
    unsigned int tx_data_offset               = 0;
    unsigned int tx_data_start_addr           = 0;
    unsigned int tx_sock1_read_pointer        = 0;
    unsigned int tx_upper_size                = 0;

    unsigned short tx_getsize_timeout_counter = 0;

    PARSE_STATUS parse_status = PARSE_NO_MATCH;

    unsigned char print[] = "rx size: xxxx\n";

    BYTE int_string[] = "0123";

    BYTE eth_buff[ETHERNET_BUFF_SIZE];

    unsigned int sock0_base_addr = 0;

    //Get sock0 base address for all the subsequent calls
    sock0_base_addr = get_sock_base_addr_by_sock_num(SOCK0);

    while(1)
    {
        switch(g_mainSM_state)
        {
            case IDLE:
#ifdef KARRI_DEBUG
                debug_print("mainSM: case IDLE\n");
#endif
                /**SET SERVER SOCKET**/
                //Set TCP mode
                WIZNET_WRITE(GET_SOCK_HW_ADDR_FROM_OFFSET(sock0_base_addr, SOCK_REG_MODE),0x01);
                //Set port to 80 (www);
                WIZNET_WRITE(GET_SOCK_HW_ADDR_FROM_OFFSET(sock0_base_addr, SOCK_REG_SOURCE_PORT0),0x00);
                WIZNET_WRITE(GET_SOCK_HW_ADDR_FROM_OFFSET(sock0_base_addr, SOCK_REG_SOURCE_PORT1),0x50);
                
                //Set socket to open
                WIZNET_WRITE(GET_SOCK_HW_ADDR_FROM_OFFSET(sock0_base_addr, SOCK_REG_COMMAND),OPEN);

                //Read status from chip
                spi_rx_byte = wiznet_read(0x0403);

                if(spi_rx_byte != SOCK_INIT)
                {
                    WIZNET_WRITE(0x0403,CLOSE);
                    g_mainSM_state = 0xFF; //Reset PIC
                }

                //Set socket to listen
                WIZNET_WRITE(0x0401,LISTEN);

                //Read status from chip
                spi_rx_byte = wiznet_read(0x0403);

                if(spi_rx_byte != SOCK_LISTEN)
                {
                    WIZNET_WRITE(0x0403,CLOSE);
                    g_mainSM_state = 0xFF; //Reset PIC
                }

                LED2_ON();

                g_mainSM_state = LISTENING;
                break;

            case LISTENING:
#ifdef KARRI_DEBUG
                debug_print("mainSM: case LISTENING\n");
#endif
                DELAY_BETWEEN_COMMANDS();
                //Read status from chip
                spi_rx_byte = wiznet_read(0x0403);

                if(spi_rx_byte == SOCK_ESTABLISHED)
                {
                    g_mainSM_state = PEER_CONNECTED;
                }
                break;

            case PEER_CONNECTED:
#ifdef KARRI_DEBUG
                debug_print("mainSM: case PEER_CONNECTED\n");
#endif
                //Get the size of received data size of socket 0
                spi_rx_byte = wiznet_read(0x0426);
                rx_data_size = (unsigned int)(spi_rx_byte << 8);
                spi_rx_byte = wiznet_read(0x0427);
                rx_data_size |= spi_rx_byte;


                if(rx_data_size > 0)
                {
                    g_mainSM_state = REQUEST_RECEIVED;
                }
                /*
                 * When working as a server and receiving data from
                 * a client, and the data size is too much for us
                 * (afterall, we only have 256 bytes of RAM), currently, on this MCU
                 * and this application, we will just RESET the CHIP and PIC,
                 * and we DULY NOTE THIS IS A SEVERE SECURITY HOLE IN A NORMAL
                 * NETWORK ENVIRONMENT. (but dont give a heck at the moment)
                 */
                if(rx_data_size > MAX_RX_SIZE)
                {
#ifdef KARRI_DEBUG
                    debug_print("RX too long, truncating!\n");

#endif
                    /* If the received data is longer than our receive buffer,
                     * we'll just truncate the data. */
                    rx_data_size = MAX_RX_SIZE - 1;
                }

